[{"model": "identity.user", "pk": 1, "fields": {"password": "pbkdf2_sha256$600000$hdjNF8lpw2hY6OMLqr7E5x$vlP8aJU5hVClW8kjy6gPn29FbGk9D/U50Rw6ljM+LAo=", "last_login": "2024-06-09T14:16:14.852Z", "is_superuser": true, "username": "admin", "first_name": "Super", "last_name": "Admin", "email": "admin@email.com", "is_staff": true, "is_active": true, "date_joined": "2024-06-08T14:45:01Z", "role": "admin", "groups": [], "user_permissions": []}}, {"model": "identity.user", "pk": 2, "fields": {"password": "pbkdf2_sha256$600000$LetBKl0EzCzye952vqRpEm$vOV5R8nohh6YJVNEQ9QKRHCiHF43ZZaoGk25fxVDwVE=", "last_login": "2024-06-09T12:44:35.886Z", "is_superuser": false, "username": "2210213575", "first_name": "ahmed", "last_name": "seghairoon", "email": "2210213575@ogrenci.karabuk.edu.tr", "is_staff": false, "is_active": true, "date_joined": "2024-06-08T14:48:55Z", "role": "student", "groups": [], "user_permissions": []}}, {"model": "library.category", "pk": 1, "fields": {"name": "Math"}}, {"model": "library.category", "pk": 2, "fields": {"name": "Physics"}}, {"model": "library.author", "pk": 1, "fields": {"name": "George B. Thomas"}}, {"model": "library.author", "pk": 2, "fields": {"name": "Joel Hass"}}, {"model": "library.author", "pk": 3, "fields": {"name": "Raymond A. Serway"}}, {"model": "library.author", "pk": 4, "fields": {"name": "John W. Jewett"}}, {"model": "library.author", "pk": 5, "fields": {"name": "David C Lay"}}, {"model": "library.author", "pk": 6, "fields": {"name": "Steven Lay"}}, {"model": "library.book", "pk": 1, "fields": {"name": "Thomas calculus", "description": "Thomas' Calculus helps students reach the level of mathematical proficiency and maturity you require, but with support for students who need it through its balance of clear and intuitive explanations, current applications, and generalized concepts. In the 14th Edition, new co-author Christopher Heil (Georgia Institute of Technology) partners with author Joel Hass to preserve what is best about Thomas' time-tested text while reconsidering every word and every piece of art with today's students in mind. The result is a text that goes beyond memorizing formulas and routine procedures to help students generalize key concepts and develop deeper understanding.", "image": "books/None.jpg", "file": "books/None.pdf", "stock": 5, "edition": 13, "category": 1, "created_at": "2024-06-08T17:07:38.903Z", "views": 11, "author": [1, 2]}}, {"model": "library.book", "pk": 2, "fields": {"name": "Serway Physics", "description": "Achieve success in your physics course by making the most of what PHYSICS FOR SCIENTISTS AND ENGINEERS has to offer you. From a host of in-text features to a range of outstanding technology resources, you'll have everything you need to understand the natural forces and principles of physics. Throughout every chapter, the authors have built in a wide range of examples, exercises, and illustrations that will help you understand the laws of physics AND succeed in your course! Available with most new copies of the text is CengageNOW for Physics. Save time, learn more, and succeed in the course with this online suite of resources that give you the choices and tools you need to study smarter and get the grade. Receive a personalized study plan based on chapter-specific diagnostic testing to help you pinpoint what you need to know NOW, and interact with a live physics tutor through the exclusive Personal Tutor with SMARTHINKING program to help you master the concepts.", "image": "books/b4599fcc-897f-4309-91d0-1db5734636d7.jpg", "file": "books/f06691eb-72f1-4179-a5b5-f25de0e2acb2.pdf", "stock": 5, "edition": 10, "category": 2, "created_at": "2024-06-09T11:32:56.235Z", "views": 15, "author": [3, 4]}}, {"model": "library.book", "pk": 3, "fields": {"name": "Linear Algebra and Its Applications", "description": "With traditional linear algebra texts, the course is relatively easy for students during the early stages as material is presented in a familiar, concrete setting. However, when abstract concepts are introduced, students often hit a wall. Instructors seem to agree that certain concepts (such as linear independence, spanning, subspace, vector space, and linear transformations) are not easily understood and require time to assimilate. These concepts are fundamental to the study of linear algebra, so students' understanding of them is vital to mastering the subject. This text makes these concepts more accessible by introducing them early in a familiar, concrete Rn setting, developing them gradually, and returning to them throughout the text so that when they are discussed in the abstract, students are readily able to understand.", "image": "books/0ea62269-ed69-49dc-8df2-83a7de08f6ee.jpg", "file": "books/b7b7f828-9cf4-425a-a395-4d1a06b0f09a.pdf", "stock": 7, "edition": 6, "category": 1, "created_at": "2024-06-09T11:55:41.862Z", "views": 4, "author": [5, 6]}}]
